# Берём официальный образ Python версии 3.11 (упрощённая версия)
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в контейнер
COPY requirements.txt .

# Устанавливаем зависимости внутри контейнера
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер
COPY . .

# Команда, которая запустится при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "4200"]